[{"title":"SICP 1-1 Exercise | SICP第一章第一节习题","date":"2020-04-14T15:09:12.000Z","path":"2020/04/SICP-1-1-Exercise/","text":"花白的SICP之旅（1） 1.1下面是一堆表达式，从上到下解释器将输出什么结果？（表达式略）一系列表达式，按部就班地做就行了 1.2请将下面表达式变换为前缀形式。（表达式略）考察前缀形式表达式 1.3请定义一个过程，它以三个数为参数，返回其中较大的两个数的平方和。（汉化版缺了“平方”） (define (Y a b c) (cond ((and (&lt; c b) (&lt; c a)) (+ a b)) ((and (&lt; b a) (&lt; b c)) (+ a c)) (else (+ b c)))) //平方和的话就是再加一个define 1.4考察允许运算符为符合表达式的组合式的求值模型，根据对模型的认识描述下面过程的行为： (define (a-plus-abs-b a b) ((if (&gt; b 0) + -) a b)) 根据b的值传出+/-函数 1.5有一种检测方法能够确定解释器以哪种（应用/正则）序求值，分别考察两种求值方式导致的后果，并做出解释。（假定if的求值规则总是一样的——谓词部分先求值，根据结果确定随后求值的子表达式） (define (p) (p)) (define (test x y) (if (= x 0) 0 y)) (test 0 (p)) 应用序求值是“先求值参数再应用”的方式，这在运行(test 0 (p))时会计算(p)而导致无限循环；而正则序求值是“完全展开再归约”，会判断(= x 0)，得到#t后输出0 1.6Alyssa看不出为何要将“if”变为一种特殊形式，整了一个船新版本if： (define (new-if predicate then-clause else-clause) (cond (predicate then-clause) (else else-clause))) 而且看起来很好用： (new-if (= 2 3) 0 5) 输出：5 (new-if (= 1 1) 0 5) 输出：0 她重写了求平方根的过程，如果用这个过程去算平方根，会发生什么事情呢？ (define (sqrt-iter guess x) (new-if (good-enough? guess x) guess (sqrt-iter (improve guess x) x))) 会Stack OverflowScheme的解释器是应用序求值，这意味着调用“new-if”时，它会试图先计算它的参数。在最后一个过程中，sqrt-iter过程会先计算(good-enough? guess x)、guess和(sqrt-iter (improve guess x) x)，它带头调用了它自己！ 1.7","tags":[{"name":"计算机","slug":"计算机","permalink":"http://yoursite.com/tags/计算机/"}]},{"title":"20 Feb 20 | 二零年二月二十日","date":"2020-02-20T15:29:16.000Z","path":"2020/02/20-Feb-20/","text":"对过去十个月，花白的事件的概括 今天Godaddy发来了这个域名的账单，突然发现已经有将近十个月没有更新网站了……先对之前发生了什么做个summary吧。 六月份高考，成功考砸去（一所很奇怪的）普通一本院校， 暑期空闲考驾照成功， 大学第一学期绩点3.2x，有很大的进步空间 不理想， 认识了现在的男友 Philis ， 开始在部分指导下学习计算机。 还有其它一些事情，就不打了……","tags":[{"name":"杂事","slug":"杂事","permalink":"http://yoursite.com/tags/杂事/"}]},{"title":"Turbulent May | 多事五月","date":"2019-06-19T15:52:42.000Z","path":"2019/06/Turbulent-May/","text":"事实上五六月份的事情都很多……春夏之交的周年庆与我关涉密切的倒不太多也不甚重要（如果高考不算的话x） 这两天，可喜可贺的，邢嘉和又多了一个新女友！（大约）空窗期比我预想得稍微长了一点，希望他这回可以长长记性，不要犯错了。↑但凭他固执的性格……所以说，我的邢学家生涯暂时结束辽，高考结束以后会整理好放在这里 说起来……高考迫近的感觉其实没多少。因为浙大大概是很难上了，也无所谓了。（2019-06-01 21:03:30） 高考结束12天，闲在家中（怎么还是五月x）。←不是重点观测得Xing正推广其推特，因此关闭Brocaproof，给他一个惊喜。明日方舟还算好玩，就是氪金体验极差，甚至不如丢到A股打水漂。","tags":[{"name":"杂事","slug":"杂事","permalink":"http://yoursite.com/tags/杂事/"}]},{"title":"Recent Hanashiro | 最近的花白","date":"2019-04-20T14:23:23.000Z","path":"2019/04/Recent-Hanashiro/","text":"50mg的Androcur副作用会不会太大了……？但之前的用量一贯如此啊。有点累了。※动态内容，可通过注释来看到其时间。 大约……还有37天就高考了。接下来要把语文的套路题解决掉，上115。数学坚决不能犯错，前面的每一题都得对（话是这么说但每次都得扣3~4分）。英语随缘，实在是达不到他的外语水平。 虽然想做的事还有很多，幻想的内容越发阴暗，但……现在是要先考试的吧，管不了那么多了。 最近盘旋在脑海里的，是考砸的选考，和已经变质的「初恋」的记忆。离终点站还有46天，朋友一个一个地减少，不论是M，还是D、X、H，都逐渐消失了。本来要把和他第一次做爱的细节尽数记下，但记忆单元的损耗程度超过想象。可能跟他说的一样吧……「你的脑子，真的是……无可救药」。 罢了，还是先准备考试了，如果……能上670的话，就挺好。（话是这么说，结果打了一上午的牌x）","tags":[{"name":"杂事","slug":"杂事","permalink":"http://yoursite.com/tags/杂事/"}]},{"title":"The Afternoon | 某个下午","date":"2019-03-30T13:03:30.000Z","path":"2019/03/The-Afternoon/","text":"如果没有2.5mg的地西泮的话，这段诡异的恋爱就没有开始的机会了。也许是R15，还是R17？不知道呢。 二零一八年十二月九日十点，我看了一下表，自知已经迟到，便不紧不慢地跑着。不知多久，我跑到了他的小区门口，刚好被他接进家里了。「这个是礼物」我把装有白色粉末的离心管递给他。「大概要多少才会…？」「只要两百毫克吧……不过这个有点泛黄，不大纯」交流着化学品的相关参数，走进了他的家。 「没有估错的话，大约六十平」，我环顾四周，快速地在心里测算着。有我家没有的客厅，电视很小，饭桌和卧室比较小，客厅角落里塞满了速食品和他的包装食材；厨房和卫生间的门口都挂着奇怪的帘子，一眼能望到的还有他父母的朴素卧室，勉强够两个人睡。「还有东西要给你」将身上的一件件东西褪下（还有我的红色（女生）校服），取出一份碟片。「我很喜欢它，希望你也是」递给他以后，又补了一句话，「这上面全是日文，我看不懂，这些你应该是会的」「有点冷，进来坐坐吧，我开了暖气」突然意识到之后预定的议程，他带着我进了房间。 很暖和，被子被杂乱地堆放在床上，地上堆满了东西，有书柜和书架各一个，排列满了书籍。在（俯视图的右上角）右前方摆放着玻璃橱柜，里面塞满了各种奇怪物件：平常只有体检时才会看到的真空采血管和一次性采血针、橡胶手套若干、毛笔几只……在床的左方是他的一台笔电，开满了软件。但最吸引我注意力的还是书架上的《大问题》——哲学社社长戴路推荐过的。「啊，这本吗？你拿去看吧，反正我看完了」（至于现在嘛，它已经作为归属未明的财产被放在抽屉里了）他点开了华农兄弟的一个视频，我正兴奋于书籍本身，偶尔抬头，被他嫌弃了。视频结束，似乎打算去做饭，但有点犹豫。「有一件很重要的事情想跟你说，但我希望在吃完以后再公布」 作者注：这段中我的实际思考能力被拔高了 「那你现在说啊，为什么现在不行？」「你还记得M吗？」M是我的初中同学，我正是因为M的关系和他相识，同时……M还是我的单相思对象。「他……怎么了？」虽然当时我的脑子已经被镇定剂严重限制了思维速度，不安感渐渐升起。「在今年的6月初……」「还是在这间房，我跟他做过了，而且……」看着逐渐崩溃的我，他平静地陈述着，「他看起来还挺享受的。」「……还有吗？」突然，我对情感的破裂不再关心，因为我的逻辑轴线尚待补全——就差这一个。「具体的时间嘛……在6月7号。如果你要问最后发生了什么，他在我嘴里射了，仅此而已」够了。我把头埋在手里，心里却在将剩余的拼图一个个补全。「这件事以后，我跟他的关系变得很尴尬，大概是做不成朋友了」，「一致」我心里暗自说着。「因为各种各样的事情，我现在已经没有几个朋友了」他稍微靠近了我一点。「所以，」我竭力假装不在乎事实的表情，「你之前的男朋友呢？」「早就跟他分了」仍然是平静的语气。镇定剂的作用似乎突然消失，我在逻辑之海中连出了一条线。「他为什么要在生日后还要叫我到他的家里，说他和我单相思对象做过爱的事实？」长久的沉默。「你还记得你前几天说过什么吗？」他突然发问。「是关于朋友间的权限问题，比如能不能叫你『嘉和』」药物的反扑作用使我只能艰难地简单作答。「所以说……你知道我想要你的什么吗？」「上回见面的时候，我觉得花白很可爱」「我想要你身体的所有权限，作为回报，我将会在毕业之前，给你你所需要的关心和温暖。」 我当时懵了，之前从来没有人这么跟我说过「我喜欢你」之类的话，而且这个人还……但现实毕竟不是漫画，没等我明白到底发生了什么，他就把我拉到面前。「他怎么离我这么近…」我必须承认的是，当时不带眼镜的邢嘉和真的很可爱——以至于我卸下了所有防备，「等等，不会是…」他温软的嘴唇贴了上来， ———— （仍然在施工中） ————","tags":[{"name":"往事","slug":"往事","permalink":"http://yoursite.com/tags/往事/"}]},{"title":"History of Broca | 邢嘉和史","date":"2019-03-23T11:02:26.000Z","path":"2019/03/History-of-Broca/","text":"初恋。欲望的机器。 171118—181209 联系人181209—190226 「恋人」至今 陌路人 前年的11月18号认识，因一个奇怪巧合[1]互相加QQ。很长时间里都是普通的联系人[2]。交流化学竞赛的内容，描述一下各自学校的状态。在去年的11月17号里看了一部电影。12月9号到他家里……被攻略成恋人了。中间见过几次面，甚至还拍了一张照片（他不让拍照所以只有一张）。 照片 今年2月26号光速分手。 细节 [1]在不知道作者是他本人的情况下盛赞其视频作品[2]“偶尔你一句我一句”的那种水平，此时他曾提及「他的男朋友」，约为第三任———— （上面这些我懒得补充，可能永远在施工中） —————-他的一些方面：性：强调是顺性别双性恋男性（可能是经常被人说娘的缘故），相当渴望肉体欢愉（人形炮机）。毫无疑问，他对性的态度相当开放，同时性爱技巧丰富。截至2019年4月18日，有过四任男友与若干任女友。家庭与经济：在十来岁之前由其祖父母带大，在他们死后由原生父母供应生活。家庭财富量不详，有一套住房（约70㎡）。父亲是普通职工，母亲迷信宗教散财颇多。每月以肉体关系接受不知道第几任男友约500元的资助。个性：拒绝婚姻之类束缚自由（待定义）的事物，漠视道德。爱好广泛（高中时期曾在学校上吊未遂，因此他依情绪上课），对哲学、语言学习、政治学、心理学、性学以及其他科学[1]感兴趣。很会做饭（亲自吃过…一次x），喜欢旅游，因为性的方面热衷做爱与研究其技巧。心理：精神疾病丰富，已知材料显示其存有双向情感障碍与失眠。在连贯所有材料以后，猜测有未诊断的■■■■■■■或■■■■■■■，它们或是其恋爱经历失败的诱因。[2]游戏：狂热爱好守望先锋（屁股），在steam上实名上网。细节 [1]自称[2]未经证实","tags":[{"name":"邢嘉和|Broca-Phenol","slug":"邢嘉和-Broca-Phenol","permalink":"http://yoursite.com/tags/邢嘉和-Broca-Phenol/"},{"name":"人物剪影","slug":"人物剪影","permalink":"http://yoursite.com/tags/人物剪影/"}]},{"title":"Intro & Foreword | 简介与前言","date":"2019-03-13T12:37:21.000Z","path":"2019/03/Intro-and-Foreword/","text":"花白（はなしろ）（@hnsr0327），高三在读，大只边障儿童。 （因为我太懒了，这部分就从日记里抄下来了x） 可以从这些方面了解我： 缺乏共情，也许不算正常人类。 因为副作用处于抑郁状态，尚无解决办法。 看过一点点动画，对目前的动漫作品几乎不了解。 在国际服万智牌竞技场里打牌。（Hnsr#03444） 心理中性，喜欢男的（现在不想谈恋爱） Hs56 Pd70 Pt67 Sc61 Ma48 Mf-M57 D82 Hy75 Pa55 Si61 喜欢的颜色有 #dd3333 #cc6677。 有过一次复杂的「恋爱经历」。 化学竞赛退役，有机差两分没能省一。 大概很早时候就有在网上写点东西的想法了，但因为懒惰一直没实现。现在还没有评论区，以后会加的（大概）。我在文章里偶尔会加一些注释，需要Chrome的开发者工具（F12）。图片均已压缩，原图统一为”/pictures/***-origin.**” 本博客（日记本）的总消耗不会超过1Mbyte（不像隔壁邢嘉和的2333(目前是50倍x)）。 部分图片/音频/文字会以注释形式给出链接（或直接内容）。","tags":[{"name":"个人简介","slug":"个人简介","permalink":"http://yoursite.com/tags/个人简介/"}]}]